package com.hzl.hadoop.util.textCompare;

import java.util.LinkedList;

/**
 * description
 *
 * @author hzl 2020/09/17 11:45 AM
 */
public class TextCompare {

	public static void main(String args[]) {
		diff_match_patch dmp = new diff_match_patch();
		LinkedList<diff_match_patch.Diff> diff = dmp.diff_main("正月，冬春季节交错\n" +
				"我依然还是冬眠前的那条虫\n" +
				"冬眠而醒。却发现\n" +
				"期待的春天\n" +
				"不是往年那般暖\n" +
				"也不是记忆里的那么美\n" +
				" \n" +
				"正月，仍然是荒芜的世界\n" +
				"我的心也荒芜着\n" +
				"停泊在青黄不结的季节\n" +
				"谋划着与荒芜演绎一场生动的离别\n" +
				" \n" +
				"身后，失去了一个可以暖身的窝\n" +
				"身前却不见春天绽放的花朵\n" +
				"眼瞅着冬与春，在十字路口厮磨着\n" +
				"我幻想着，正月之后与春的奇妙相约\n" +
				" \n" +
				"正月，一年的起点\n" +
				"如今迈步从头越\n" +
				"在通往春天的路上\n" +
				"已走着零星的先行者\n" +
				"路边的野草，也冬眠而醒\n" +
				"睁开了惺忪的眼睛\n" +
				"看着，阳光与春光明媚地相拥，重合\n" +
				" \n" +
				"正月，是万物苏醒的季节\n" +
				"也是游子们出发的季节\n" +
				"他们带走了两脚故乡的泥土\n" +
				"和故乡天空的云朵\n" +
				"却念念不忘与故乡的又一次离别\n" +
				" \n" +
				"路旁的野草，山羊，斑鸠\n" +
				"和两排柳树，都留给了我和正月\n" +
				" \n" +
				"我爬上柳梢枝头\n" +
				"望着游子们的背影，渐渐\n" +
				"变成天边如帆的云朵\n" +
				"我和正月，在故乡的路上\n" +
				"随两排柳树一起随风婆娑\n" +
				"——盼望着春风如剪的二月\n" +
				" \n" +
				"我是冬眠的一条虫\n" +
				"告诉你，这里是正月\n" +
				"春在前方二月里\n" +
				"也在二月前方外……", "正月，冬春季节交错\n" +
				"我依然还是冬眠前的那条虫\n" +
				"冬眠而醒。却发现\n" +
				"期待的春天\n" +
				"不是往年那般暖\n" +
				"也不是记忆里3的那么美\n" +
				" \n" +
				"正月，仍然是荒芜的世界\n" +
				"我的心也荒芜着\n" +
				"停泊在青黄不结的季节\n" +
				"谋划着与荒芜演绎一场生动的离别\n" +
				" \n" +
				"身后，失去了一个可以暖身的窝\n" +
				"身前却不见春2天绽放的花朵\n" +
				"眼瞅着冬与春，在十字路口厮磨着\n" +
				"我幻想着，正月之后与春的奇妙相约\n" +
				" \n" +
				"正月，一年的起点\n" +
				"如今迈步从头越\n" +
				"在通往春2天的路上\n" +
				"已走着零星的先行者\n" +
				"路边的野草，也冬眠而醒\n" +
				"睁开了惺1忪的眼睛\n" +
				"看着，阳光与春光明媚地相拥，重合\n" +
				" \n" +
				"正月，是万物苏醒的季节\n" +
				"也是游子们出发的季节\n" +
				"他们带走了两脚故乡的泥土\n" +
				"和故乡天空的云朵\n" +
				"却念念不忘与故乡的又一次离别\n" +
				" \n" +
				"和两排柳树，都留给了我和正月\n" +
				" \n" +
				"我爬上柳梢枝头\n" +
				"望着游子们的背影，渐渐\n" +
				"变成天边如帆的云朵\n" +
				"我和正月，在故乡的路上\n" +
				"随两排柳树一起随风婆娑\n" +
				"——盼望着春风如剪的二月\n" +
				" \n" +
				"我是冬眠的一条虫\n" +
				"告诉你，这里是正月\n" +
				"春在前方二月里\n" +
				"也在二月前方外……");
		// Result: [(-1, "Hell"), (1, "G"), (0, "o"), (1, "odbye"), (0, " World.")]
		dmp.diff_cleanupSemantic(diff);
		// Result: [(-1, "Hello"), (1, "Goodbye"), (0, " World.")]
		System.out.println(diff);
	}

}
